k6-test-main/zeta/kyverno-load-testing/k6/15rep/kyverno-pods-zeta.js-100vu-200it-logs.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: /script/script.js
     output: -

  scenarios: (100.00%) 1 scenario, 100 max VUs, 10m30s max duration (incl. graceful stop):
           * default: 200 iterations shared among 100 VUs (maxDuration: 10m0s, gracefulStop: 30s)

time="2023-12-21T09:18:47Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T09:18:47Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T09:18:47Z" level=info msg="received response 201 201 Created" source=console
[...]
time="2023-12-21T09:18:48Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T09:18:48Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T09:18:48Z" level=info msg="received response 201 201 Created" source=console
[...]

running (00m01.0s), 100/100 VUs, 37 complete and 0 interrupted iterations
default   [  18% ] 100 VUs  00m01.0s/10m0s  037/200 shared iters
time="2023-12-21T09:18:48Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T09:18:48Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T09:18:48Z" level=info msg="received response 201 201 Created" source=console
[...]
time="2023-12-21T09:18:49Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T09:18:49Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T09:18:49Z" level=info msg="received response 201 201 Created" source=console
[...]

running (00m02.0s), 100/100 VUs, 67 complete and 0 interrupted iterations
default   [  34% ] 100 VUs  00m02.0s/10m0s  067/200 shared iters
time="2023-12-21T09:18:50Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T09:18:50Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T09:18:50Z" level=info msg="received response 201 201 Created" source=console
[...]

running (00m03.0s), 100/100 VUs, 96 complete and 0 interrupted iterations
default   [  48% ] 100 VUs  00m03.0s/10m0s  096/200 shared iters
time="2023-12-21T09:18:50Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T09:18:50Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T09:18:50Z" level=info msg="received response 201 201 Created" source=console
[...]
time="2023-12-21T09:18:51Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T09:18:51Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T09:18:51Z" level=info msg="received response 201 201 Created" source=console
[...]

running (00m04.0s), 079/100 VUs, 121 complete and 0 interrupted iterations
default   [  60% ] 100 VUs  00m04.0s/10m0s  121/200 shared iters
time="2023-12-21T09:18:51Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T09:18:51Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T09:18:51Z" level=info msg="received response 201 201 Created" source=console
[...]
time="2023-12-21T09:18:52Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T09:18:52Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T09:18:52Z" level=info msg="received response 201 201 Created" source=console
[...]

running (00m05.0s), 058/100 VUs, 142 complete and 0 interrupted iterations
default   [  71% ] 100 VUs  00m05.0s/10m0s  142/200 shared iters
time="2023-12-21T09:18:53Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T09:18:53Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T09:18:53Z" level=info msg="received response 201 201 Created" source=console
[...]

running (00m06.0s), 053/100 VUs, 147 complete and 0 interrupted iterations
default   [  74% ] 100 VUs  00m06.0s/10m0s  147/200 shared iters
time="2023-12-21T09:18:54Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T09:18:54Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T09:18:54Z" level=info msg="received response 201 201 Created" source=console
[...]

running (00m07.0s), 045/100 VUs, 155 complete and 0 interrupted iterations
default   [  78% ] 100 VUs  00m07.0s/10m0s  155/200 shared iters
time="2023-12-21T09:18:54Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T09:18:55Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T09:18:55Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T09:18:55Z" level=info msg="received response 201 201 Created" source=console
[...]

running (00m08.0s), 027/100 VUs, 173 complete and 0 interrupted iterations
default   [  86% ] 100 VUs  00m08.0s/10m0s  173/200 shared iters
time="2023-12-21T09:18:56Z" level=info msg="received response 201 201 Created" source=console

running (00m09.0s), 026/100 VUs, 174 complete and 0 interrupted iterations
default   [  87% ] 100 VUs  00m09.0s/10m0s  174/200 shared iters
time="2023-12-21T09:18:56Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T09:18:56Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T09:18:57Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T09:18:57Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T09:18:57Z" level=info msg="received response 201 201 Created" source=console

running (00m10.0s), 021/100 VUs, 179 complete and 0 interrupted iterations
default   [  90% ] 100 VUs  00m10.0s/10m0s  179/200 shared iters
time="2023-12-21T09:18:57Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T09:18:57Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T09:18:57Z" level=info msg="received response 201 201 Created" source=console
[...]
time="2023-12-21T09:18:58Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T09:18:58Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T09:18:58Z" level=info msg="received response 201 201 Created" source=console
[...]

     ✓ verify response code of POST is 201

     █ teardown

     checks.........................: 100.00% ✓ 200      ✗ 0    
     data_received..................: 640 kB  59 kB/s
     data_sent......................: 192 kB  18 kB/s
     http_req_blocked...............: avg=9.61ms   min=234ns   med=1.45ms  max=52.56ms  p(90)=43.02ms  p(95)=49.76ms 
     http_req_connecting............: avg=6.46ms   min=0s      med=33.83µs max=45.37ms  p(90)=37.08ms  p(95)=43.91ms 
     http_req_duration..............: avg=3.26s    min=39.12ms med=1.82s   max=10.02s   p(90)=9.12s    p(95)=10.01s  
       { expected_response:true }...: avg=3.26s    min=39.12ms med=1.82s   max=10.02s   p(90)=9.12s    p(95)=10.01s  
     http_req_failed................: 0.00%   ✓ 0        ✗ 200  
     http_req_receiving.............: avg=84.81µs  min=29.39µs med=74.3µs  max=531.22µs p(90)=124.98µs p(95)=143.97µs
     http_req_sending...............: avg=104.19µs min=39.55µs med=76.69µs max=1.25ms   p(90)=110.34µs p(95)=130.12µs
     http_req_tls_handshaking.......: avg=3.07ms   min=0s      med=1.32ms  max=10.91ms  p(90)=7.77ms   p(95)=8.26ms  
     http_req_waiting...............: avg=3.26s    min=39ms    med=1.82s   max=10.02s   p(90)=9.12s    p(95)=10.01s  
     http_reqs......................: 200     18.31485/s
     iteration_duration.............: avg=3.26s    min=2.4µs   med=1.84s   max=10.07s   p(90)=9.14s    p(95)=10.02s  
     iterations.....................: 200     18.31485/s
     vus............................: 21      min=21     max=100
     vus_max........................: 100     min=100    max=100


running (00m10.9s), 000/100 VUs, 200 complete and 0 interrupted iterations
default ✓ [ 100% ] 100 VUs  00m10.9s/10m0s  200/200 shared iters
============== STRIP ==============
{
    "metrics": {
        "checks": {
            "fails": 0,
            "passes": 200,
            "value": 1
        },
        "vus_max": {
            "min": 100,
            "max": 100,
            "value": 100
        },
        "http_req_tls_handshaking": {
            "avg": 3.071405205000001,
            "min": 0,
            "med": 1.329029,
            "max": 10.912285,
            "p(90)": 7.7704906,
            "p(95)": 8.26593325
        },
        "http_req_receiving": {
            "p(90)": 0.1249853,
            "p(95)": 0.14397385,
            "avg": 0.08481269999999996,
            "min": 0.029394,
            "med": 0.074308,
            "max": 0.531229
        },
        "http_req_connecting": {
            "min": 0,
            "med": 0.0338385,
            "max": 45.372565,
            "p(90)": 37.0801464,
            "p(95)": 43.9171736,
            "avg": 6.466236314999999
        },
        "iteration_duration": {
            "min": 0.002406,
            "med": 1843.674343,
            "max": 10073.072551,
            "p(90)": 9148.876272,
            "p(95)": 10028.191243,
            "avg": 3261.426870303484
        },
        "http_req_failed": {
            "passes": 0,
            "fails": 200,
            "value": 0
        },
        "data_received": {
            "rate": 58572.08135913042,
            "count": 639613
        },
        "http_req_blocked": {
            "p(95)": 49.76615555,
            "avg": 9.619113895,
            "min": 0.000234,
            "med": 1.4565624999999998,
            "max": 52.566334,
            "p(90)": 43.0219747
        },
        "iterations": {
            "count": 200,
            "rate": 18.31485018569992
        },
        "http_req_duration": {
            "avg": 3267.2915149499995,
            "min": 39.128121,
            "med": 1827.4296545,
            "max": 10023.148248,
            "p(90)": 9121.5291975,
            "p(95)": 10012.77610515
        },
        "data_sent": {
            "count": 191651,
            "rate": 17550.296764697876
        },
        "vus": {
            "value": 21,
            "min": 21,
            "max": 100
        },
        "http_reqs": {
            "count": 200,
            "rate": 18.31485018569992
        },
        "http_req_duration{expected_response:true}": {
            "max": 10023.148248,
            "p(90)": 9121.5291975,
            "p(95)": 10012.77610515,
            "avg": 3267.2915149499995,
            "min": 39.128121,
            "med": 1827.4296545
        },
        "http_req_sending": {
            "p(90)": 0.1103442,
            "p(95)": 0.13012594999999985,
            "avg": 0.10419308000000006,
            "min": 0.039557,
            "med": 0.07669699999999999,
            "max": 1.254649
        },
        "http_req_waiting": {
            "max": 10022.908832,
            "p(90)": 9121.3955197,
            "p(95)": 10012.6193092,
            "avg": 3267.1025091700008,
            "min": 39.007356,
            "med": 1827.258444
        }
    },
    "root_group": {
        "id": "d41d8cd98f00b204e9800998ecf8427e",
        "groups": {
            "teardown": {
                "checks": {},
                "name": "teardown",
                "path": "::teardown",
                "id": "a8a9942382e8ffe2e56ef29e664b8229",
                "groups": {}
            }
        },
        "checks": {
            "verify response code of POST is 201": {
                "id": "8c3ca26510f8061c444b510eb133612e",
                "passes": 200,
                "fails": 0,
                "name": "verify response code of POST is 201",
                "path": "::verify response code of POST is 201"
            }
        },
        "name": "",
        "path": ""
    }
}